submission_logs/4_1_full_system_read_sharded/64/2/1-9/2/memtier/5.log
1         Threads
2         Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets         165.88          ---          ---      4.57700       670.05 
Gets         165.87      1490.99         1.80      7.45400      6026.42 
Waits          0.00          ---          ---      0.00000          --- 
Totals       331.74      1490.99         1.80      6.01600      6696.48 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.400         0.02
SET       1.500         0.24
SET       1.600         1.14
SET       1.700         3.44
SET       1.800         7.54
SET       1.900        13.04
SET       2.000        19.73
SET       2.100        26.53
SET       2.200        32.99
SET       2.300        38.30
SET       2.400        42.22
SET       2.500        45.42
SET       2.600        48.28
SET       2.700        50.47
SET       2.800        52.27
SET       2.900        53.89
SET       3.000        55.09
SET       3.100        56.30
SET       3.200        57.22
SET       3.300        58.00
SET       3.400        58.96
SET       3.500        59.76
SET       3.600        60.42
SET       3.700        60.88
SET       3.800        61.35
SET       3.900        61.90
SET       4.000        62.39
SET       4.100        62.90
SET       4.200        63.53
SET       4.300        63.91
SET       4.400        64.49
SET       4.500        65.05
SET       4.600        65.59
SET       4.700        66.03
SET       4.800        66.61
SET       4.900        67.12
SET       5.000        67.52
SET       5.100        67.89
SET       5.200        68.43
SET       5.300        69.06
SET       5.400        69.66
SET       5.500        70.21
SET       5.600        70.72
SET       5.700        71.19
SET       5.800        71.80
SET       5.900        72.32
SET       6.000        72.91
SET       6.100        73.45
SET       6.200        74.00
SET       6.300        74.52
SET       6.400        75.01
SET       6.500        75.55
SET       6.600        76.03
SET       6.700        76.45
SET       6.800        76.86
SET       6.900        77.36
SET       7.000        77.85
SET       7.100        78.20
SET       7.200        78.59
SET       7.300        79.14
SET       7.400        79.54
SET       7.500        80.02
SET       7.600        80.54
SET       7.700        81.19
SET       7.800        81.64
SET       7.900        82.18
SET       8.000        82.60
SET       8.100        83.17
SET       8.200        83.77
SET       8.300        84.36
SET       8.400        85.13
SET       8.500        85.80
SET       8.600        86.44
SET       8.700        87.02
SET       8.800        87.73
SET       8.900        88.21
SET       9.000        88.73
SET       9.100        89.23
SET       9.200        89.82
SET       9.300        90.39
SET       9.400        90.80
SET       9.500        91.18
SET       9.600        91.53
SET       9.700        91.81
SET       9.800        92.07
SET       9.900        92.37
SET      10.000        93.48
SET      11.000        95.53
SET      12.000        97.45
SET      13.000        97.82
SET      14.000        98.28
SET      15.000        98.55
SET      16.000        98.75
SET      17.000        98.98
SET      18.000        99.12
SET      19.000        99.25
SET      20.000        99.40
SET      21.000        99.48
SET      22.000        99.51
SET      23.000        99.62
SET      24.000        99.70
SET      25.000        99.77
SET      26.000        99.83
SET      27.000        99.87
SET      28.000        99.89
SET      29.000        99.92
SET      30.000        99.92
SET      31.000        99.95
SET      32.000        99.97
SET      33.000        99.98
SET      49.000        99.99
SET      50.000       100.00
---
GET       2.300         0.01
GET       2.400         0.06
GET       2.500         0.17
GET       2.600         0.50
GET       2.700         1.24
GET       2.800         2.53
GET       2.900         4.53
GET       3.000         7.31
GET       3.100        10.47
GET       3.200        13.95
GET       3.300        17.54
GET       3.400        20.92
GET       3.500        24.07
GET       3.600        27.05
GET       3.700        29.98
GET       3.800        32.26
GET       3.900        34.41
GET       4.000        36.13
GET       4.100        37.51
GET       4.200        38.94
GET       4.300        40.22
GET       4.400        41.30
GET       4.500        42.16
GET       4.600        42.82
GET       4.700        43.65
GET       4.800        44.36
GET       4.900        44.99
GET       5.000        45.49
GET       5.100        46.00
GET       5.200        46.47
GET       5.300        46.94
GET       5.400        47.29
GET       5.500        47.72
GET       5.600        48.21
GET       5.700        48.70
GET       5.800        49.12
GET       5.900        49.44
GET       6.000        49.92
GET       6.100        50.44
GET       6.200        50.87
GET       6.300        51.28
GET       6.400        51.61
GET       6.500        52.03
GET       6.600        52.44
GET       6.700        52.93
GET       6.800        53.40
GET       6.900        53.87
GET       7.000        54.31
GET       7.100        54.94
GET       7.200        55.34
GET       7.300        55.76
GET       7.400        56.27
GET       7.500        56.81
GET       7.600        57.31
GET       7.700        57.78
GET       7.800        58.24
GET       7.900        58.81
GET       8.000        59.28
GET       8.100        59.76
GET       8.200        60.29
GET       8.300        60.74
GET       8.400        61.24
GET       8.500        61.66
GET       8.600        61.99
GET       8.700        62.37
GET       8.800        62.75
GET       8.900        63.08
GET       9.000        63.50
GET       9.100        63.87
GET       9.200        64.19
GET       9.300        64.53
GET       9.400        64.87
GET       9.500        65.22
GET       9.600        65.52
GET       9.700        65.99
GET       9.800        66.37
GET       9.900        66.78
GET      10.000        69.79
GET      11.000        76.90
GET      12.000        84.07
GET      13.000        94.33
GET      14.000        96.91
GET      15.000        97.55
GET      16.000        97.99
GET      17.000        98.38
GET      18.000        98.55
GET      19.000        98.74
GET      20.000        99.01
GET      21.000        99.15
GET      22.000        99.34
GET      23.000        99.44
GET      24.000        99.53
GET      25.000        99.61
GET      26.000        99.71
GET      27.000        99.79
GET      28.000        99.90
GET      29.000        99.95
GET      30.000        99.96
GET      32.000        99.97
GET      34.000        99.98
GET      35.000       100.00
---